# GIT -распределенная система контроля версий 
# Это система для отслеживание и ведение истории изменение файлов , в вашем проекте 

# Репизиторий (локальный/удаленый) - хранилеше вашего кода истории его изменений 


#  GitHub -веб сайт для разрешение dit -репизиторов в соместной разработке

# команды Git:

# git init-> она создает локальный гит репииторий у вас на п, в той дирректоррии в который была прописана команда.

#git status -> команда для проеверки статуса наших файлов

#git add-> команда для добавление файлов в систему отслеживание гита, после этой команды изменение начинают фиксироваться

#git commit -m "coment"-> коминада для сохранение версии в локальный репизитории вместе с коментареим к изменением 


# git remote add origin <url> -> это команда для того чтобы устаговить связь локального репизитория с удалееным в гитхабе


# git push -> команда для отправки ващших изменений в локальном репо в удальныый репо
              #git push origin main



# #==============================Констуркция Git==============================      
#                    1) git init(1раз) # для создание
#                    2) git add . # для отслеживание  изменений
#                    3) git commit -m 'comment' # для фиксации версии проекта в локальном репо
#                    4) git remote add origin<url> #3  для создание связи (1 раз)
#                    5)git push origin main#отправка всех версий на удалаенный реквизатор 
jnbfhsdbfjb