# GIT -распределенная система контроля версий 
# Это система для отслеживание и ведение истории изменение файлов , в вашем проекте 

# Репизиторий (локальный/удаленый) - хранилеше вашего кода истории его изменений 


#  GitHub -веб сайт для разрешение dit -репизиторов в соместной разработке

# команды Git:

# git init-> она создает локальный гит репииторий у вас на п, в той дирректоррии в который была прописана команда.

#git status -> команда для проеверки статуса наших файлов

#git add-> команда для добавление файлов в систему отслеживание гита, после этой команды изменение начинают фиксироваться

#git comit -m "coment"-> коминада для сохранение версии в локальный репизитории вместе с коментареим к изменением 
john