"===================================Pytest=============================="


"TESTS - это проверка вашего кода, тесты бывают ручного типа и автотесты"



"pytest - это библиотека, для тестирование кода"



"================== Запуск тестов ================="
#pytest - запуск тестов с текущей директории , всех дочерних

#pytest test_name.py - запуск оперделенного теста

#pytest test_name.py::test_1 -  запуск оперделленого тест - функции в оперделенном файле

"!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
"Название всех файлов с тестами должна начинатьсся на test_название.py,  либо название_test.py"


"Название тест- функций должно начинаться с test_название"

